In [2]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df=pd.DataFrame(np.random.randn(5,5))

In [6]:
df

          0         1         2         3         4
0  1.896399 -0.961990 -0.067951  1.045551  1.110186
1  1.172656  0.388974 -0.106391  1.638622  0.281167
2  1.911636 -2.380231 -0.103380 -2.330382 -0.529961
3  1.579786  1.419303  0.411574 -0.101181  1.081429
4 -0.651346 -1.222160  0.167972 -0.983631 -1.682842

In [8]:
df.iloc[2:, 1:3] = np.nan

In [9]:
df

          0         1         2         3         4
0  1.896399 -0.961990 -0.067951  1.045551  1.110186
1  1.172656  0.388974 -0.106391  1.638622  0.281167
2  1.911636       NaN       NaN       NaN -0.529961
3  1.579786       NaN       NaN       NaN  1.081429
4 -0.651346       NaN       NaN       NaN -1.682842

In [10]:
df.columns=list('ABCDE')

In [11]:
df

          A         B         C         D         E
0  1.896399 -0.961990 -0.067951  1.045551  1.110186
1  1.172656  0.388974 -0.106391  1.638622  0.281167
2  1.911636       NaN       NaN       NaN -0.529961
3  1.579786       NaN       NaN       NaN  1.081429
4 -0.651346       NaN       NaN       NaN -1.682842

In [13]:
df[df[B].isnull() == True]

NameError: name 'B' is not defined

In [14]:
df[df['B'].isnull() == True]

          A   B   C   D         E
2  1.911636 NaN NaN NaN -0.529961
3  1.579786 NaN NaN NaN  1.081429
4 -0.651346 NaN NaN NaN -1.682842

In [15]:
df=pd.DataFrame(np.random.randn(5,5))

In [16]:
df

          0         1         2         3         4
0  0.082256  0.264682 -0.643380 -1.785989 -0.452297
1  1.955259 -0.133886 -0.629224 -0.599910 -0.776858
2 -0.183240  0.509205 -1.142877  0.431463  0.624369
3  1.429813 -0.760222 -0.868787 -0.842533  0.099749
4 -0.281261  0.509003 -0.373166  1.085345  0.718250

In [17]:
df.iloc[2,3]=np.nan
df.iloc[4,2]=np.nan

In [18]:
df

          0         1         2         3         4
0  0.082256  0.264682 -0.643380 -1.785989 -0.452297
1  1.955259 -0.133886 -0.629224 -0.599910 -0.776858
2 -0.183240  0.509205 -1.142877       NaN  0.624369
3  1.429813 -0.760222 -0.868787 -0.842533  0.099749
4 -0.281261  0.509003       NaN  1.085345  0.718250

In [22]:
df.columns=list('ABCDE')
df

          A         B         C         D         E
0  0.082256  0.264682 -0.643380 -1.785989 -0.452297
1  1.955259 -0.133886 -0.629224 -0.599910 -0.776858
2 -0.183240  0.509205 -1.142877       NaN  0.624369
3  1.429813 -0.760222 -0.868787 -0.842533  0.099749
4 -0.281261  0.509003       NaN  1.085345  0.718250

In [20]:
df[df['C'].isnull() == True]

          A         B   C         D        E
4 -0.281261  0.509003 NaN  1.085345  0.71825

In [21]:
df[df['D'].isnull() == True]

         A         B         C   D         E
2 -0.18324  0.509205 -1.142877 NaN  0.624369